---
kind: method
id: M:Autodesk.Revit.DB.WorksetId.ToString
source: html/9938a154-6fa9-1ac2-ce46-7bb61fcec970.htm
---
# Autodesk.Revit.DB.WorksetId.ToString Method

Gets a String representation of the integer value of the id.

## Syntax (C#)
```csharp
public override string ToString()
```